#+title: Practice integration problems

These problems will help you practice solving integration problems. They are optional, and they will not be graded. Some of them are from past quizzes and exams. You should eventually be able to solve these kinds of problems in about 20 minutes.

* Generalized factorial function                                       :quad:

The \Gamma function is defined by:

$\Gamma(x) = \int_0^\infty e^{-t}t^{x-1} dt$

It is a generalized factorial function. When the arguments to the function are integers, the following relation is true:

$\Gamma(n + 1) = n!$

Show that this is true for the first 10 integers starting from 0. You can use the ~math.factorial~ function.

#+BEGIN_SRC ipython
from math import factorial

factorial(4)
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[87]:
# text/plain
: 24
:END:


* Legendre polynomials

The Legendre polynomials are defined by:

$P_n(x) = \sum_{m=0}^M (-1)^m \frac{(2n - 2m)!}{2^n m! (n-m)!(n - 2m)!} x^{n-2m}$

where $M= n/2$ if n is even or $(n-1) / 2$ if $n$ is odd. $m!$ means "the factorial of m", for example, 4! = 1 * 2 * 3 * 4 = 24. You can compute it like this:

#+BEGIN_SRC ipython
from math import factorial
factorial(4)
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[1]:
# text/plain
: 24
:END:

Here is a helpful function to compute $M$:

#+BEGIN_SRC ipython
import numpy as np
def M(n):
    if np.mod(n, 2) == 0:  # this means n is even.
        return int(n / 2)
    else:
        return int((n - 1) / 2)
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[22]:
:END:


Write a function that computes ~P(x, n)~, and plot the function for ~n=3~ and ~n=4~ on the range of x=-1 to x=1.

#+BEGIN_SRC ipython

#+END_SRC

These polynomials are /orthogonal/ on the domain of x=-1 to 1, which means:

$\int_{-1}^{1} P_3(x) P_4(x) dx = 0$

Show that is true using your function.

#+BEGIN_SRC ipython

#+END_SRC


